# We will compare the two data structures using the world_alcohol.csv data.

#### In a Numpy 2d-array (aka matrix), all columns must have the same data type. So we can either have all columns with float type values, all with int type values, all with string type values, and so on. So whenever we have mixed-type data, we can only handle it with a numpy array by treating all columns as string type (dtype="U75"). Furthermore, we need to skip the header, otherwise column names will also be included in values.
#### 1. Let's import numpy into our Jupyter Notebook environment and read in the data.

In [1]:
import numpy as np
np_array = np.genfromtxt("world_alcohol.csv", delimiter=",", dtype="U75", skip_header=1)
np_array[:5]

array([['1986', 'Western Pacific', 'Viet Nam', 'Wine', '0'],
       ['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27'],
       ['1987', 'Americas', 'Saint Kitts and Nevis', 'Beer', '1.98']],
      dtype='<U75')

#### In a Pandas dataframe, individual columns can have different data types. So we can have some columns with float type values, some with int type values, some with string type values, and so on. 
#### 2. Let's import Pandas into our Jupyter Notebook environment and read in the data.

In [2]:
import pandas as pd
df = pd.read_csv("world_alcohol.csv")
df.head()

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

## np_array: use [ ] notation always 
## df: use iloc and loc most of the time; use [ ] notation occasionally

#### 1. For Numpy np_array, the [ ] notation is everything we need to select data. The format is:
    np_array[row OR slice_of_rows OR list_of_rows, column OR slice_of_columns OR list_of_columns]   
#### 2a. For Pandas df, the equivalent of [ ] notation are the iloc and loc methods which are used most of the time. The format is:
    df.iloc[row OR slice_of_rows OR list_of_rows, column OR slice_of_columns OR list_of_columns]
    df.loc[row_label OR slice_of_row_labels OR list_of_row_labels, col_label OR slice_of_col_labels OR list_of_col_labels]
#### 2b. For Pandas df, the [ ] notation can be used occasionally to either select a slice or list of rows, or a column or list of columns. The format is:
    df[slice_of_rows OR list_of_rows]
    df[single column OR list_of_columns]

# --------------------- Select all rows ---------------------

## Select all rows, and all columns:

#### Numpy np_array: We'll use [:5] to limit output from now onwards.

In [3]:
np_array[:][:5]

array([['1986', 'Western Pacific', 'Viet Nam', 'Wine', '0'],
       ['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27'],
       ['1987', 'Americas', 'Saint Kitts and Nevis', 'Beer', '1.98']],
      dtype='<U75')

In [4]:
np_array[:,:][:5]

array([['1986', 'Western Pacific', 'Viet Nam', 'Wine', '0'],
       ['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27'],
       ['1987', 'Americas', 'Saint Kitts and Nevis', 'Beer', '1.98']],
      dtype='<U75')

#### Pandas df: We'll use .head() to limit output from now onwards.

In [5]:
df.head()

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

In [6]:
df.iloc[:].head()

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

In [7]:
df.iloc[:,:].head()

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

## Select all rows, and column 3:

#### Numpy np_array:

In [8]:
np_array[:,3][:5]

array(['Wine', 'Other', 'Wine', 'Beer', 'Beer'], dtype='<U75')

#### Pandas df:

In [9]:
df.iloc[:,3].head()

0     Wine
1    Other
2     Wine
3     Beer
4     Beer
Name: Beverage Types, dtype: object

## Select all rows, and a slice_of_columns (columns 1 to 4):

#### Numpy np_array:

In [10]:
np_array[:,1:4][:5]

array([['Western Pacific', 'Viet Nam', 'Wine'],
       ['Americas', 'Uruguay', 'Other'],
       ['Africa', "Cte d'Ivoire", 'Wine'],
       ['Americas', 'Colombia', 'Beer'],
       ['Americas', 'Saint Kitts and Nevis', 'Beer']], dtype='<U75')

#### Pandas df:

In [11]:
df.iloc[:,1:4].head()

        WHO region                Country Beverage Types
0  Western Pacific               Viet Nam           Wine
1         Americas                Uruguay          Other
2           Africa           Cte d'Ivoire           Wine
3         Americas               Colombia           Beer
4         Americas  Saint Kitts and Nevis           Beer

## Select all rows, and a list_of_columns (columns 1, 2, 3, 4):

#### Numpy np_array:

In [12]:
np_array[:,[1,2,3,4]][:5]

array([['Western Pacific', 'Viet Nam', 'Wine', '0'],
       ['Americas', 'Uruguay', 'Other', '0.5'],
       ['Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['Americas', 'Colombia', 'Beer', '4.27'],
       ['Americas', 'Saint Kitts and Nevis', 'Beer', '1.98']],
      dtype='<U75')

#### Pandas df:

In [13]:
df.iloc[:,[1,2,3,4]].head()

        WHO region                Country Beverage Types  Display Value
0  Western Pacific               Viet Nam           Wine           0.00
1         Americas                Uruguay          Other           0.50
2           Africa           Cte d'Ivoire           Wine           1.62
3         Americas               Colombia           Beer           4.27
4         Americas  Saint Kitts and Nevis           Beer           1.98

# --------------------- Select a specific row ---------------------

## Select row 2, and all columns:

#### Numpy np_array:

In [14]:
np_array[2]

array(['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'], dtype='<U75')

In [15]:
np_array[2,:]

array(['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'], dtype='<U75')

#### Pandas df: 
Only iloc can be used. If we had labeled rows, we could also use loc instead.

In [16]:
df.iloc[2]

Year                      1985
WHO region              Africa
Country           Cte d'Ivoire
Beverage Types            Wine
Display Value             1.62
Name: 2, dtype: object

In [17]:
df.iloc[2,:]

Year                      1985
WHO region              Africa
Country           Cte d'Ivoire
Beverage Types            Wine
Display Value             1.62
Name: 2, dtype: object

## Select row 2, and column 3:

#### Numpy np_array:

In [18]:
np_array[2,3]

'Wine'

#### Pandas df:

In [19]:
df.iloc[2,3]

'Wine'

In [20]:
df.iloc[2]["Beverage Types"]

'Wine'

## Select row 2, and a slice_of_columns (columns 1 to 4):

#### Numpy np_array: column slice end-bound (4) won't be included

In [21]:
np_array[2,1:4]

array(['Africa', "Cte d'Ivoire", 'Wine'], dtype='<U75')

#### Pandas df: column slice end-bound (4) won't be included

In [22]:
df.iloc[2,1:4]

WHO region              Africa
Country           Cte d'Ivoire
Beverage Types            Wine
Name: 2, dtype: object

In [23]:
df.iloc[2]["WHO region":"Beverage Types"]

WHO region              Africa
Country           Cte d'Ivoire
Beverage Types            Wine
Name: 2, dtype: object

## Select row 2, and a list_of_columns (columns 1, 2, 3, 4):

#### Numpy np_array:

In [24]:
np_array[2,[1,2,3,4]]

array(['Africa', "Cte d'Ivoire", 'Wine', '1.62'], dtype='<U75')

#### Pandas df:

In [25]:
df.iloc[2,[1,2,3,4]]

WHO region              Africa
Country           Cte d'Ivoire
Beverage Types            Wine
Display Value             1.62
Name: 2, dtype: object

In [26]:
df.iloc[2][["WHO region","Country","Beverage Types","Display Value"]]

WHO region              Africa
Country           Cte d'Ivoire
Beverage Types            Wine
Display Value             1.62
Name: 2, dtype: object

# --------------------- Select a slice of rows ---------------------

## Select a slice_of_rows (rows 1 to 4), and all columns:

#### Numpy np_array: row slice end-bound (4) won't be included

In [27]:
np_array[1:4]

array([['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27']], dtype='<U75')

In [28]:
np_array[1:4,:]

array([['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27']], dtype='<U75')

#### Pandas df: row slice end-bound (4) won't be included

In [29]:
df.iloc[1:4]

   Year WHO region       Country Beverage Types  Display Value
1  1986   Americas       Uruguay          Other           0.50
2  1985     Africa  Cte d'Ivoire           Wine           1.62
3  1986   Americas      Colombia           Beer           4.27

In [30]:
df.iloc[1:4,:]

   Year WHO region       Country Beverage Types  Display Value
1  1986   Americas       Uruguay          Other           0.50
2  1985     Africa  Cte d'Ivoire           Wine           1.62
3  1986   Americas      Colombia           Beer           4.27

## Select a slice_of_rows (rows 1 to 4), and column 4:

#### Numpy np_array: row slice end-bound (4) won't be included

In [31]:
np_array[1:4,4]

array(['0.5', '1.62', '4.27'], dtype='<U75')

#### Pandas df: row slice end-bound (4) won't be included

In [32]:
df.iloc[1:4,4]

1    0.50
2    1.62
3    4.27
Name: Display Value, dtype: float64

In [33]:
df.iloc[1:4]["Display Value"]

1    0.50
2    1.62
3    4.27
Name: Display Value, dtype: float64

## Select a slice_of_rows (rows 1 to 4), and a slice_of_columns (columns 1 to 4):

#### Numpy np_array: row slice and column slice end-bound (4) won't be included

In [34]:
np_array[1:4,1:4]

array([['Americas', 'Uruguay', 'Other'],
       ['Africa', "Cte d'Ivoire", 'Wine'],
       ['Americas', 'Colombia', 'Beer']], dtype='<U75')

#### Pandas df: row slice and column slice end-bound (4) won't be included

In [35]:
df.iloc[1:4,1:4]

  WHO region       Country Beverage Types
1   Americas       Uruguay          Other
2     Africa  Cte d'Ivoire           Wine
3   Americas      Colombia           Beer

## Select a slice_of_rows (rows 1 to 4), and a list_of_columns (columns 1, 2, 3, 4):

#### Numpy np_array: row slice end-bound (4) won't be included

In [36]:
np_array[1:4,[1,2,3,4]]

array([['Americas', 'Uruguay', 'Other', '0.5'],
       ['Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['Americas', 'Colombia', 'Beer', '4.27']], dtype='<U75')

#### Pandas df: row slice end-bound (4) won't be included

In [37]:
df.iloc[1:4,[1,2,3,4]]

  WHO region       Country Beverage Types  Display Value
1   Americas       Uruguay          Other           0.50
2     Africa  Cte d'Ivoire           Wine           1.62
3   Americas      Colombia           Beer           4.27

# --------------------- Select a list of rows ---------------------

## Select a list_of_rows (rows 1, 2, 3, 4), and all columns:

#### Numpy np_array:

In [38]:
np_array[[1,2,3,4]]

array([['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27'],
       ['1987', 'Americas', 'Saint Kitts and Nevis', 'Beer', '1.98']],
      dtype='<U75')

In [39]:
np_array[[1,2,3,4],:]

array([['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27'],
       ['1987', 'Americas', 'Saint Kitts and Nevis', 'Beer', '1.98']],
      dtype='<U75')

#### Pandas df:

In [40]:
df.iloc[[1,2,3,4]]

   Year WHO region                Country Beverage Types  Display Value
1  1986   Americas                Uruguay          Other           0.50
2  1985     Africa           Cte d'Ivoire           Wine           1.62
3  1986   Americas               Colombia           Beer           4.27
4  1987   Americas  Saint Kitts and Nevis           Beer           1.98

In [41]:
df.iloc[[1,2,3,4],:]

   Year WHO region                Country Beverage Types  Display Value
1  1986   Americas                Uruguay          Other           0.50
2  1985     Africa           Cte d'Ivoire           Wine           1.62
3  1986   Americas               Colombia           Beer           4.27
4  1987   Americas  Saint Kitts and Nevis           Beer           1.98

## Select a list_of_rows (rows 1, 2, 3, 4), and column 4:

#### Numpy np_array:

In [42]:
np_array[[1,2,3,4],4]

array(['0.5', '1.62', '4.27', '1.98'], dtype='<U75')

#### Pandas df:

In [43]:
df.iloc[[1,2,3,4],4]

1    0.50
2    1.62
3    4.27
4    1.98
Name: Display Value, dtype: float64

## Select a list_of_rows (rows 1, 2, 3, 4), and a slice_of_columns (columns 1 to 4):

#### Numpy np_array: column slice end-bound (4) won't be included

In [44]:
np_array[[1,2,3,4],1:4]

array([['Americas', 'Uruguay', 'Other'],
       ['Africa', "Cte d'Ivoire", 'Wine'],
       ['Americas', 'Colombia', 'Beer'],
       ['Americas', 'Saint Kitts and Nevis', 'Beer']], dtype='<U75')

#### Pandas df: column slice end-bound (4) won't be included

In [45]:
df.iloc[[1,2,3,4],1:4]

  WHO region                Country Beverage Types
1   Americas                Uruguay          Other
2     Africa           Cte d'Ivoire           Wine
3   Americas               Colombia           Beer
4   Americas  Saint Kitts and Nevis           Beer

## Select a list_of_rows (rows 1, 2, 3, 4), and a list_of_columns (columns 1, 2, 3, 4):

#### Numpy np_array: This is VERY strange; instead of being the same as df.iloc, it has returned the diagonal values of df.iloc

In [46]:
np_array[[1,2,3,4],[1,2,3,4]]

array(['Americas', "Cte d'Ivoire", 'Beer', '1.98'], dtype='<U75')

#### Pandas df:

In [47]:
df.iloc[[1,2,3,4],[1,2,3,4]]

  WHO region                Country Beverage Types  Display Value
1   Americas                Uruguay          Other           0.50
2     Africa           Cte d'Ivoire           Wine           1.62
3   Americas               Colombia           Beer           4.27
4   Americas  Saint Kitts and Nevis           Beer           1.98

## Filter by values of one or more Columns using Boolean Logic

### The conditional dataset with the column "Year"==1985

#### Numpy np_array: We'll use [:5] to limit output from now onwards.

In [48]:
np_array[np_array[:,0]=='1985'][:5]

array([['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1985', 'Africa', 'Angola', 'Spirits', '0.39'],
       ['1985', 'Western Pacific', "Lao People's Democratic Republic",
        'Beer', '0'],
       ['1985', 'Western Pacific', 'Viet Nam', 'Spirits', '0.05'],
       ['1985', 'Africa', 'Comoros', 'Other', '']], dtype='<U75')

#### Pandas df: We'll use .head() to limit output from now onwards.

In [49]:
df[df["Year"]==1985].head()

,Year,WHO region,Country,Beverage Types,Display Value
2,1985,Africa,Cte d'Ivoire,Wine,1.62
7,1985,Africa,Angola,Spirits,0.39
12,1985,Western Pacific,Lao People's Democratic Republic,Beer,0.00
14,1985,Western Pacific,Viet Nam,Spirits,0.05
24,1985,Africa,Comoros,Other,NaN

### The conditional dataset with "Year"==1985 OR "Year"==1986 (must enclose conditions in parentheses now )

#### Numpy np_array:

In [50]:
np_array[(np_array[:,0]=='1985') | (np_array[:,0]=='1986')][:5]

array([['1986', 'Western Pacific', 'Viet Nam', 'Wine', '0'],
       ['1986', 'Americas', 'Uruguay', 'Other', '0.5'],
       ['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1986', 'Americas', 'Colombia', 'Beer', '4.27'],
       ['1985', 'Africa', 'Angola', 'Spirits', '0.39']], dtype='<U75')

#### Pandas df:

In [51]:
df[(df["Year"]==1985) | (df["Year"]==1986)].head()

   Year       WHO region       Country Beverage Types  Display Value
0  1986  Western Pacific      Viet Nam           Wine           0.00
1  1986         Americas       Uruguay          Other           0.50
2  1985           Africa  Cte d'Ivoire           Wine           1.62
3  1986         Americas      Colombia           Beer           4.27
7  1985           Africa        Angola        Spirits           0.39

### The conditional dataset with "Year"==1985 AND "WHO region"=="Africa"

#### Numpy np_array:

In [52]:
np_array[(np_array[:,0]=='1985') & (np_array[:,1]=='Africa')][:5]

array([['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1985', 'Africa', 'Angola', 'Spirits', '0.39'],
       ['1985', 'Africa', 'Comoros', 'Other', ''],
       ['1985', 'Africa', 'Mauritania', 'Other', '0'],
       ['1985', 'Africa', 'Mali', 'Other', '0.57']], dtype='<U75')

#### Pandas df:

In [53]:
df[(df["Year"]==1985) & (df["WHO region"]=="Africa")].head()

    Year WHO region       Country Beverage Types  Display Value
2   1985     Africa  Cte d'Ivoire           Wine           1.62
7   1985     Africa        Angola        Spirits           0.39
24  1985     Africa       Comoros          Other            NaN
33  1985     Africa    Mauritania          Other           0.00
71  1985     Africa          Mali          Other           0.57

### The conditional dataset with "Year"==1985 AND "WHO region"=="Africa" AND "Country"=="Comoros"

#### Numpy np_array:

In [54]:
np_array[(np_array[:,0]=='1985') & (np_array[:,1]=='Africa') & (np_array[:,2]=='Comoros')][:5]

array([['1985', 'Africa', 'Comoros', 'Other', ''],
       ['1985', 'Africa', 'Comoros', 'Beer', '0.02'],
       ['1985', 'Africa', 'Comoros', 'Wine', '0.05'],
       ['1985', 'Africa', 'Comoros', 'Spirits', '0.3']], dtype='<U75')

#### Pandas df:

In [55]:
df[(df["Year"]==1985) & (df["WHO region"]=="Africa") & (df["Country"]=="Comoros")]

      Year WHO region  Country Beverage Types  Display Value
24    1985     Africa  Comoros          Other            NaN
76    1985     Africa  Comoros           Beer           0.02
655   1985     Africa  Comoros           Wine           0.05
1858  1985     Africa  Comoros        Spirits           0.30

### The conditional dataset with ( "Year"==1985 OR "Year"==1986 ) AND "WHO region"=="Africa"

#### Numpy np_array:

In [56]:
np_array[((np_array[:,0]=='1985') | (np_array[:,0]=='1986')) & (np_array[:,1]=='Africa')][:5]

array([['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1985', 'Africa', 'Angola', 'Spirits', '0.39'],
       ['1985', 'Africa', 'Comoros', 'Other', ''],
       ['1986', 'Africa', 'Sierra Leone', 'Other', '4.48'],
       ['1985', 'Africa', 'Mauritania', 'Other', '0']], dtype='<U75')

#### Pandas df:

In [57]:
df[((df["Year"]==1985) | (df["Year"]==1986))  & (df["WHO region"]=="Africa")].head()

    Year WHO region       Country Beverage Types  Display Value
2   1985     Africa  Cte d'Ivoire           Wine           1.62
7   1985     Africa        Angola        Spirits           0.39
24  1985     Africa       Comoros          Other            NaN
30  1986     Africa  Sierra Leone          Other           4.48
33  1985     Africa    Mauritania          Other           0.00

### The conditional dataset with ( "Year"==1985 OR "Year"==1986 ) AND .............................
### ........................................................ ( "WHO region"=="Africa" OR "WHO region"=="Europe" )

#### Numpy np_array:

In [58]:
np_array[((np_array[:,0]=='1985') | (np_array[:,0]=='1986')) & ((np_array[:,1]=='Africa') | (np_array[:,1]=='Europe'))][:5]

array([['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1985', 'Africa', 'Angola', 'Spirits', '0.39'],
       ['1985', 'Africa', 'Comoros', 'Other', ''],
       ['1985', 'Europe',
        'United Kingdom of Great Britain and Northern Ireland', 'Wine',
        '1.36'],
       ['1986', 'Europe', 'Italy', 'Other', '']], dtype='<U75')

#### Pandas df:

In [59]:
df[((df["Year"]==1985) | (df["Year"]==1986)) & ((df["WHO region"]=="Africa") | (df["WHO region"]=="Europe"))].head()

,Year,WHO region,Country,Beverage Types,Display Value
2,1985,Africa,Cte d'Ivoire,Wine,1.62
7,1985,Africa,Angola,Spirits,0.39
24,1985,Africa,Comoros,Other,NaN
26,1985,Europe,United Kingdom of Great Britain and Northern I...,Wine,1.36
29,1986,Europe,Italy,Other,NaN

### Now let's explore how to access rows or columns in jumps of an integer index.

### Starting from the "Year" column, access every other column:

#### Numpy np_array:

In [60]:
np_array[:,0::2][:5]

array([['1986', 'Viet Nam', '0'],
       ['1986', 'Uruguay', '0.5'],
       ['1985', "Cte d'Ivoire", '1.62'],
       ['1986', 'Colombia', '4.27'],
       ['1987', 'Saint Kitts and Nevis', '1.98']], dtype='<U75')

#### Pandas df:

In [61]:
df.iloc[:,0::2].head()

   Year                Country  Display Value
0  1986               Viet Nam           0.00
1  1986                Uruguay           0.50
2  1985           Cte d'Ivoire           1.62
3  1986               Colombia           4.27
4  1987  Saint Kitts and Nevis           1.98

### Starting from the 3rd row, access every 4th row:

#### Numpy np_array:

In [62]:
np_array[2::4][:5]

array([['1985', 'Africa', "Cte d'Ivoire", 'Wine', '1.62'],
       ['1987', 'Africa', 'Mauritius', 'Wine', '0.13'],
       ['1987', 'Africa', 'Botswana', 'Wine', '0.2'],
       ['1985', 'Western Pacific', 'Viet Nam', 'Spirits', '0.05'],
       ['1984', 'Europe', 'Norway', 'Spirits', '1.62']], dtype='<U75')

#### Pandas df:

In [63]:
df.iloc[2::4].head()

    Year       WHO region       Country Beverage Types  Display Value
2   1985           Africa  Cte d'Ivoire           Wine           1.62
6   1987           Africa     Mauritius           Wine           0.13
10  1987           Africa      Botswana           Wine           0.20
14  1985  Western Pacific      Viet Nam        Spirits           0.05
18  1984           Europe        Norway        Spirits           1.62